import requests

API_TOKEN = ""
regions = {
    #4: "Вінницька область",
    0: 4,
    #9: "Дніпропетровська область",
    2: 9,
    #28: "Донецька область",
    3: 28,
    #10: "Житомирська область",
    4: 10,
    #11: "Закарпатська область",
    5: 11,
    #12: "Запорізька область",
    6: 12,
    #13: "Івано-Франківська область",
    7: 13,
    #31: "м. Київ"
    8: 31,
    #15: "Кіровоградська область",
    9: 15,
    #27: "Львівська область",
    10: 27,
    #17: "Миколаївська область",
    11: 17,
    #18: "Одеська область",
    12: 18,
    #19: "Полтавська область",
    13: 19,
    #5: "Рівненська область",
    14: 5,
    #20: "Сумська область",
    15: 20,
    #21: "Тернопільська область",
    16: 21,
    #22: "Харківська область",
    17: 22,
    #23: "Херсонська область",
    18: 23,
    #3: "Хмельницька область",
    19: 3,
    #24: "Черкаська область",
    20: 24,
    #26: "Чернівецька область",
    21: 26,
    #25: "Чернігівська область",
    22: 25,
}


def alarms_for_now(uid):
    if uid == 1:
        return 0
    try:
        url = f"https://api.alerts.in.ua/v1/iot/active_air_raid_alerts/{regions[uid]}.json?token={API_TOKEN}"
        response = requests.get(url)
        response_json = response.json()
        if response_json and response_json[0] == "N":
            return 0
        return 1
    except KeyError as e:
        print(f"Uebak na kluchi {uid}")
        return 0
    except Exception as e:
        print(f"Uebak na kluchi {uid}")
        return 0

